let MESSAGE = {
  kr: {
    BUTTON: {
      B0001: "EDIT", //카테고리 편집 버튼명
      B0002: "로그아웃",
      B0003: "완료", //카테고리 편집창에서의 닫기 버튼
      B0004: "더 보기" //컨텐츠 리스트 더보기
    },
    ALERT: {
      A0001: "하위 카테고리를 포함하고 있어, 삭제할 수 없습니다.",
      A0002: "상위 카테고리를 지정(클릭)하셔야 합니다.",
      A0003: `모든 백업파일을 삭제할 수는 없습니다. <br>1개 이상의 백업파일은 남겨두세요.`,
      A0004: "백업이 완료 되었습니다.",
      A0005: "복구가 완료 되었습니다.",
      A0006: "백업 대상과 로그인 계정이 다릅니다.",
      A0007: "복구 할 대상이 존재하지 않습니다.",
      A0008: "백업 도중 에러가 발생하였습니다."
    },
    CONFIRM: {
      C0001: "카테고리를 삭제 하시겠습니까?"
    },
    DESCRIPTION: {
      D0001: "카테고리 검색", //카테고리 검색 영역의 placeholder
      D0002: `<b>새로운 카테고리를 생성하여,<br/>컨텐츠를 분류해보세요.</b>`,
      D0003:
        "카테고리를 상하로 Drag&Drop으로 자유롭게 순서를 정렬할 수 있습니다.",
      D0004:
        "하위 카테고리에서 상위 카테고리로 Drag&Drop 하여 Tree 구조를 자유롭게 구성할 수 있습니다.",
      D0005: "상위 카테고리",
      D0006: "상위 카테고리명을 추가 및 수정합니다.",
      D0007: "상위 카테고리가 없습니다.",
      D0008: "하위 카테고리",
      D0009: "하위 카테고리명을 추가 및 수정합니다.",
      D0010:
        "상위 카테고리를 선택하지 않았거나, 하위 카테고리가 존재하지 않습니다.",
      D0011: "선택된 카테고리에서 컨텐츠의 제목/본문을 검색합니다.",
      D0012: "검색어 입력 후 엔터", //placeholder
      D0013: "등록순서로 정렬합니다.",
      D0014: "★ 표시 컨테츠를 필터링 합니다.",
      D0015: "스크래핑에 실패한 컨텐츠를 필터링 합니다.",
      D0016: "",
      D0017: "",
      D0018: "",
      D0019: "",
      D0020: "",
      D0021: ""
    },
    SNACK: {
      S0001: "편집 중에는, 하위 카테고리를 이동 할 수 없습니다.",
      S0002: "카테고리명을 입력하세요.",
      S0003: "STAR를 해제하였습니다.",
      S0004: "STAR로 지정하였습니다.",
      S0005: "ITEM(s)이 없습니다.",
      S0006: "마지막 ITEM 입니다.",
      S0007: "LOCK이 해제되었습니다.",
      S0008: "URL이 복사되었습니다.",
      S0009: "IMPORT 되었습니다.",
      S0010: "COLOR가 저장되었습니다.",
      S0011: "Color지정은 6개까지입니다.",
      S0012: "Color를 1개 이상 지정해야합니다.",
      S0013: "백업파일을 삭제하였습니다.",
      S0014: "카테고리에 저장되었습니다.",
      S0015: "카테고리 저장에 실패하였습니다. 다시 시도바랍니다.",
      S0016: "정확한 패스워드가 아닙니다. 다시 시도해주세요.",
      S0017: "이미 존재하는 계정입니다.",
      S0018: "로 테마가 변경되었습니다.",
      S0019: "'IMPORT BOOKMARK' 기능은 준비중입니다."
    },
    M0001: "현재 브라우저는 Web SQL Database를 지원합니다.",
    M0002: "현재 브라우저는 Web SQL Database를 지원하지 않습니다."
  },
  en: {},
  jp: {
    BUTTON: {
      B0001: "EDIT", //카테고리 편집 버튼명
      B0002: "ログアウト",
      B0003: "確認", //카테고리 편집창에서의 닫기 버튼
      B0004: "もっと見る" //컨텐츠 리스트 더보기
    },
    ALERT: {
      A0001: "下位カテゴリが含まれているため、削除ができません。",
      A0002: "上位カテゴリの指定が必要です。",
      A0003: `全てのバックアップファイルを削除ができません。<br>１つ以上のバックアップファイルは残してください。`,
      A0004: "バックアップを完了しました。",
      A0005: "ファイルリカバリーを完了しました。",
      A0006: "バックアップ対象とログインアカウントが間違っています。",
      A0007: "リカバリーするファイルがありません。",
      A0008: "バックアップ途中でエラーが発生しました。"
    },
    CONFIRM: {
      C0001: "カテゴリーを削除しますか？"
    },
    DESCRIPTION: {
      D0001: "カテゴリー検索", //카테고리 검색 영역의 placeholder
      D0002: `<b>新しいカテゴリーを生成し、<br/>コンテンツを分けてみてください。</b>`,
      D0003: "カテゴリーを上下にDrag&Dropを行い、自由にソートができます。",
      D0004:
        "하위 카테고리에서 상위 카테고리로 Drag&Drop 하여 Tree 구조를 자유롭게 구성할 수 있습니다.",
      D0005: "상위 카테고리",
      D0006: "상위 카테고리명을 추가 및 수정합니다.",
      D0007: "상위 카테고리가 없습니다.",
      D0008: "하위 카테고리",
      D0009: "하위 카테고리명을 추가 및 수정합니다.",
      D0010:
        "상위 카테고리를 선택하지 않았거나, 하위 카테고리가 존재하지 않습니다.",
      D0011: "선택된 카테고리에서 컨텐츠의 제목/본문을 검색합니다.",
      D0012: "검색어 입력 후 엔터", //placeholder
      D0013: "등록순서로 정렬합니다.",
      D0014: "★ 표시 컨테츠를 필터링 합니다.",
      D0015: "스크래핑에 실패한 컨텐츠를 필터링 합니다.",
      D0016: "",
      D0017: "",
      D0018: "",
      D0019: "",
      D0020: "",
      D0021: ""
    },
    SNACK: {
      S0001: "편집 중에는, 하위 카테고리를 이동 할 수 없습니다.",
      S0002: "카테고리명을 입력하세요.",
      S0003: "STAR를 해제하였습니다.",
      S0004: "STAR로 지정하였습니다.",
      S0005: "ITEM(s)이 없습니다.",
      S0006: "마지막 ITEM 입니다.",
      S0007: "LOCK이 해제되었습니다.",
      S0008: "URL이 복사되었습니다.",
      S0009: "IMPORT 되었습니다.",
      S0010: "COLOR가 저장되었습니다.",
      S0011: "Color지정은 6개까지입니다.",
      S0012: "Color를 1개 이상 지정해야합니다.",
      S0013: "백업파일을 삭제하였습니다.",
      S0014: "카테고리에 저장되었습니다.",
      S0015: "카테고리 저장에 실패하였습니다. 다시 시도바랍니다.",
      S0016: "정확한 패스워드가 아닙니다. 다시 시도해주세요.",
      S0017: "이미 존재하는 계정입니다.",
      S0018: "로 테마가 변경되었습니다.",
      S0019: "'IMPORT BOOKMARK' 기능은 준비중입니다."
    },
    M0001: "현재 브라우저는 Web SQL Database를 지원합니다.",
    M0002: "현재 브라우저는 Web SQL Database를 지원하지 않습니다."
  }
};
let LANG = {
  lang: "kr",
  getMessage: code => {
    return MESSAGE[LANG.lang][code];
  },
  BUTTON_MESSAGE: code => {
    return MESSAGE[LANG.lang].BUTTON[code];
  },
  ALERT_MESSAGE: code => {
    return MESSAGE[LANG.lang].ALERT[code];
  },
  CONFIRM_MESSAGE: code => {
    return MESSAGE[LANG.lang].CONFIRM[code];
  },
  DESCRIPTION_MESSAGE: code => {
    return MESSAGE[LANG.lang].DESCRIPTION[code];
  },
  SNACK_MESSAGE: code => {
    return MESSAGE[LANG.lang].SNACK[code];
  }
};
export default LANG;
